{"meta":{"title":"A blog for learning and thinking","subtitle":"","description":"学习博客","author":"yeemj","url":"http://example.com","root":"/"},"pages":[{"title":"catagory","date":"2020-12-30T11:13:22.000Z","updated":"2020-12-30T11:13:22.464Z","comments":true,"path":"catagory/index.html","permalink":"http://example.com/catagory/index.html","excerpt":"","text":""},{"title":"tag","date":"2020-12-30T11:12:42.000Z","updated":"2020-12-30T11:12:42.612Z","comments":true,"path":"tag/index.html","permalink":"http://example.com/tag/index.html","excerpt":"","text":""}],"posts":[{"title":"yeemj's first blog","slug":"yeemj-s-first-blog","date":"2020-12-30T03:13:17.000Z","updated":"2020-12-30T07:18:53.168Z","comments":true,"path":"2020/12/30/yeemj-s-first-blog/","link":"","permalink":"http://example.com/2020/12/30/yeemj-s-first-blog/","excerpt":"This blog is an introduction to myself and my blog!","text":"This blog is an introduction to myself and my blog! Welcome to yeemj’s blog, this is my first blog, my github URL yeemj.github.io, welcome to collect and visit oftern. If you have any diffirent opinions or problems, you can leave me a message, or send me an email &#x79;&#101;&#x32;&#48;&#49;&#x35;&#x30;&#x31;&#48;&#x35;&#x33;&#x36;&#x40;&#49;&#54;&#x33;&#x2e;&#x63;&#x6f;&#109;. Self introduction​ My name is abbreviated as yeemj. I am still a second year postgraduate student, my undergraduate major is process Equipment and control Engineering. The name of graduate major is also this, but changed a name: chemical process machinery. However, I did not study the field of my major during my postgraduate period, my research task is the control and navigation of underwater vehicles. So I studied computer code programming during my postgraduate period, I learn MCU Arduino, and at the same time, I’m learning C#. According to the requirements of the project, I will also learn MATLAB. There is an old saying that the best way to learn is to output, so I start my own blog. My blog Share my study notes, mainly computer study, reading; Share my learning experience, mainly the problems I encountered, and how did I solve them; Daily thinking. Categories CS Now I’m only involved in the first two and the last three, the rest haven’t started learning yet, but they are in the learning plan. So, fighting! Git and Github and Hexo Python Linux SQL Arduino C# Matlab Books and movies Life thinking ​","categories":[],"tags":[{"name":"record","slug":"record","permalink":"http://example.com/tags/record/"}]}],"categories":[],"tags":[{"name":"record","slug":"record","permalink":"http://example.com/tags/record/"}]}